conf/src/Documents/ЭП_АктПриемаПередачи/ЭП_АктПриемаПередачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЭП_АктПриемаПередачи</name>
  <registerRecords>InformationRegister.ЭП_КачествоНоменклатуры</registerRecords>
  <registerRecords>AccumulationRegister.ЭП_ОстаткиПоОрганизацииРН</registerRecords>
  <registerRecords>AccumulationRegister.ЭП_ОстаткиНаСкладе</registerRecords>
  <registerRecords>AccumulationRegister.ЭП_ОстаткиНаСотрудниках</registerRecords>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.ЭП_Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ЭП_ВидыОперций</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отвественный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.ЭП_Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.ЭП_Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнвентарныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидНоменклатуры</name>
      <type>
        <types>CatalogRef.ЭП_ВидНоменлкатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КачествоНоменклатуры</name>
      <type>
        <types>CatalogRef.ЭП_КачествоНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

conf/src/AccumulationRegisters/ЭП_ОстаткиНаСотрудниках/ЭП_ОстаткиНаСотрудниках.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЭП_ОстаткиНаСотрудниках</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.ЭП_Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

conf/src/AccumulationRegisters/ЭП_ОстаткиПоОрганизацииРН/ЭП_ОстаткиПоОрганизацииРН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЭП_ОстаткиПоОрганизацииРН</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.ЭП_Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.ЭП_Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

conf/src/InformationRegisters/ЭП_КачествоНоменклатуры/ЭП_КачествоНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭП_КачествоНоменклатуры</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>КачествоНоменклатуры</name>
    <type>
      <types>CatalogRef.ЭП_КачествоНоменклатуры</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.ЭП_Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

conf/src/AccumulationRegisters/ЭП_ОстаткиНаСкладе/ЭП_ОстаткиНаСкладе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЭП_ОстаткиНаСкладе</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.ЭП_Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.ЭП_Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

conf/src/Enums/ЭП_ВидыОперций/ЭП_ВидыОперций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЭП_ВидыОперций</name>
  <enumValues>
    <name>ПередачаНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ПриемНоменклатуры</name>
  </enumValues>
</mdclass:Enum>

conf/src/Documents/ЭП_АктПриемаПередачи/Forms/ФормаПодбора/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	НоменклатураВыбор = Параметры.НоменклатураВыбор;
	
	Для Каждого ТоварТч Из НоменклатураВыбор Цикл
		
		Элемент = НоменклатураДляПередачи.Добавить();
		Элемент.ВидНоменклатуры = ТоварТч.ВидНоменклатуры;
		Элемент.ИнвентарныйНомер = ТоварТч.ИнвентарныйНомер; 
		Элемент.Номенклатура = ТоварТч.Номенклатура;
		Элемент.КачествоНоменклатуры = ТоварТч.КачествоНоменклатуры;
		
	КонецЦикла;
	
	МассивИнвентарныйНомер = Новый Массив;
	
	Для Каждого СтрТЗ ИЗ НоменклатураВыбор Цикл 
		МассивИнвентарныйНомер.Добавить(СтрТЗ.ИнвентарныйНомер);
	КонецЦикла;
	
	Если МассивИнвентарныйНомер.Количество() <> 0 И Параметры.ВидОперации = Перечисления.ЭП_ВидыОперций.ПриемНоменклатуры Тогда	
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭП_ОстаткиНаСотрудникахОстатки.Номенклатура КАК Номенклатура,
		|	ЭП_ОстаткиНаСотрудникахОстатки.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ЭП_Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РегистрНакопления.ЭП_ОстаткиНаСотрудниках.Остатки КАК ЭП_ОстаткиНаСотрудникахОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Номенклатура КАК ЭП_Номенклатура
		|		ПО ЭП_ОстаткиНаСотрудникахОстатки.Номенклатура = ЭП_Номенклатура.Ссылка
		|ГДЕ
		|	ЭП_ОстаткиНаСотрудникахОстатки.Сотрудник = &Сотрудник
		|	И ЭП_ОстаткиНаСотрудникахОстатки.КоличествоОстаток > 0
		|	И НЕ ЭП_ОстаткиНаСотрудникахОстатки.ИнвентарныйНомер В (&ИнвентарныйНомер)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Номенклатура КАК Номенклатура,
		|	ВТ.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ВТ.ВидНоменклатуры КАК ВидНоменклатуры
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЭП_ОстаткиПоОрганизацииРН.Остатки(, Организация = &Организация) КАК ЭП_ОстаткиПоОрганизацииРНОстатки
		|		ПО ВТ.Номенклатура = ЭП_ОстаткиПоОрганизацииРНОстатки.Номенклатура
		|			И ВТ.ИнвентарныйНомер = ЭП_ОстаткиПоОрганизацииРНОстатки.ИнвентарныйНомер
		|ГДЕ
		|	ЭП_ОстаткиПоОрганизацииРНОстатки.КоличествоОстаток > 0";
		
		Запрос.УстановитьПараметр("ИнвентарныйНомер", МассивИнвентарныйНомер);
		Запрос.УстановитьПараметр("Сотрудник", Параметры.Сотрудник); 
		Запрос.УстановитьПараметр("Организация", Параметры.Организация);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл 
			ВидНоменклатуры = Выборка.ВидНоменклатуры;
			Номенклатура = Выборка.Номенклатура;
			ИнвентарныйНомер = Выборка.ИнвентарныйНомер;
			НовСтр = НоменклатураДляВыдачи.Добавить();
			НовСтр.НоменклатураВыдача = Номенклатура;
			НовСтр.ИнвентарныйНомерВыдача = ИнвентарныйНомер;
			НовСтр.ВидНоменклатуры = ВидНоменклатуры;
			НовСтр.КачествоНоменклатуры = РегистрыСведений.ЭП_КачествоНоменклатуры.ПолучитьПоследнее(ТекущаяДатаСеанса(), 
							Новый Структура("Номенклатура, ИнвентарныйНомер",Номенклатура,ИнвентарныйНомер)).КачествоНоменклатуры;
			ЗаполнитьЗначенияСвойств(НовСтр,Выборка);		
		КонецЦикла; 
		
	ИначеЕсли МассивИнвентарныйНомер.Количество() = 0 И Параметры.ВидОперации = Перечисления.ЭП_ВидыОперций.ПриемНоменклатуры Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭП_ОстаткиНаСотрудникахОстатки.Номенклатура КАК Номенклатура,
		|	ЭП_ОстаткиНаСотрудникахОстатки.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ЭП_Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РегистрНакопления.ЭП_ОстаткиНаСотрудниках.Остатки КАК ЭП_ОстаткиНаСотрудникахОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Номенклатура КАК ЭП_Номенклатура
		|		ПО ЭП_ОстаткиНаСотрудникахОстатки.Номенклатура = ЭП_Номенклатура.Ссылка
		|ГДЕ
		|	ЭП_ОстаткиНаСотрудникахОстатки.Сотрудник = &Сотрудник
		|	И ЭП_ОстаткиНаСотрудникахОстатки.КоличествоОстаток > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Номенклатура КАК Номенклатура,
		|	ВТ.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ВТ.ВидНоменклатуры КАК ВидНоменклатуры
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЭП_ОстаткиПоОрганизацииРН.Остатки(, Организация = &Организация) КАК ЭП_ОстаткиПоОрганизацииРНОстатки
		|		ПО ВТ.Номенклатура = ЭП_ОстаткиПоОрганизацииРНОстатки.Номенклатура
		|			И ВТ.ИнвентарныйНомер = ЭП_ОстаткиПоОрганизацииРНОстатки.ИнвентарныйНомер
		|ГДЕ
		|	ЭП_ОстаткиПоОрганизацииРНОстатки.КоличествоОстаток > 0";
		
		Запрос.УстановитьПараметр("Сотрудник", Параметры.Сотрудник);
		Запрос.УстановитьПараметр("Организация", Параметры.Организация);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл 
			ВидНоменклатуры = Выборка.ВидНоменклатуры;
			Номенклатура = Выборка.Номенклатура;
			ИнвентарныйНомер = Выборка.ИнвентарныйНомер;
			НовСтр = НоменклатураДляВыдачи.Добавить();
			НовСтр.НоменклатураВыдача = Номенклатура;
			НовСтр.ИнвентарныйНомерВыдача = ИнвентарныйНомер;
			НовСтр.ВидНоменклатуры = ВидНоменклатуры;
			НовСтр.КачествоНоменклатуры = РегистрыСведений.ЭП_КачествоНоменклатуры.ПолучитьПоследнее(ТекущаяДатаСеанса(), 
							Новый Структура("Номенклатура, ИнвентарныйНомер",Номенклатура,ИнвентарныйНомер)).КачествоНоменклатуры;
			ЗаполнитьЗначенияСвойств(НовСтр,Выборка);		
		КонецЦикла;
		
	ИначеЕсли МассивИнвентарныйНомер.Количество() = 0 И Параметры.ВидОперации = Перечисления.ЭП_ВидыОперций.ПередачаНоменклатуры Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭП_ОстаткиНаСкладеОстатки.Номенклатура КАК Номенклатура,
		|	ЭП_ОстаткиНаСкладеОстатки.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ЭП_Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РегистрНакопления.ЭП_ОстаткиНаСкладе.Остатки КАК ЭП_ОстаткиНаСкладеОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Номенклатура КАК ЭП_Номенклатура
		|		ПО ЭП_ОстаткиНаСкладеОстатки.Номенклатура = ЭП_Номенклатура.Ссылка
		|ГДЕ
		|	ЭП_ОстаткиНаСкладеОстатки.Склад = &Склад
		|	И ЭП_ОстаткиНаСкладеОстатки.КоличествоОстаток > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Номенклатура КАК Номенклатура,
		|	ВТ.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ВТ.ВидНоменклатуры КАК ВидНоменклатуры
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЭП_ОстаткиПоОрганизацииРН.Остатки(, Организация = &Организация) КАК ЭП_ОстаткиПоОрганизацииРНОстатки
		|		ПО ВТ.Номенклатура = ЭП_ОстаткиПоОрганизацииРНОстатки.Номенклатура
		|			И ВТ.ИнвентарныйНомер = ЭП_ОстаткиПоОрганизацииРНОстатки.ИнвентарныйНомер
		|ГДЕ
		|	ЭП_ОстаткиПоОрганизацииРНОстатки.КоличествоОстаток > 0";
		
		Запрос.УстановитьПараметр("Склад", Параметры.Склад);
		Запрос.УстановитьПараметр("Организация", Параметры.Организация);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл  
			
			ВидНоменклатуры = Выборка.ВидНоменклатуры;
			Номенклатура = Выборка.Номенклатура;
			ИнвентарныйНомер = Выборка.ИнвентарныйНомер;
			НовСтр = НоменклатураДляВыдачи.Добавить();
			НовСтр.НоменклатураВыдача = Номенклатура;
			НовСтр.ИнвентарныйНомерВыдача = ИнвентарныйНомер;
			НовСтр.ВидНоменклатуры = ВидНоменклатуры;
			НовСтр.КачествоНоменклатуры = РегистрыСведений.ЭП_КачествоНоменклатуры.ПолучитьПоследнее(ТекущаяДатаСеанса(), 
							Новый Структура("Номенклатура, ИнвентарныйНомер",Номенклатура,ИнвентарныйНомер)).КачествоНоменклатуры;
			ЗаполнитьЗначенияСвойств(НовСтр,Выборка);
			
		КонецЦикла; 
		
	ИначеЕсли МассивИнвентарныйНомер.Количество() <> 0 И Параметры.ВидОперации = Перечисления.ЭП_ВидыОперций.ПередачаНоменклатуры Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭП_ОстаткиНаСкладеОстатки.Номенклатура КАК Номенклатура,
		|	ЭП_ОстаткиНаСкладеОстатки.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ЭП_Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РегистрНакопления.ЭП_ОстаткиНаСкладе.Остатки КАК ЭП_ОстаткиНаСкладеОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Номенклатура КАК ЭП_Номенклатура
		|		ПО ЭП_ОстаткиНаСкладеОстатки.Номенклатура = ЭП_Номенклатура.Ссылка
		|ГДЕ
		|	ЭП_ОстаткиНаСкладеОстатки.Склад = &Склад
		|	И ЭП_ОстаткиНаСкладеОстатки.КоличествоОстаток > 0
		|	И НЕ ЭП_ОстаткиНаСкладеОстатки.ИнвентарныйНомер В (&ИнвентарныйНомер)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Номенклатура КАК Номенклатура,
		|	ВТ.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ВТ.ВидНоменклатуры КАК ВидНоменклатуры
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЭП_ОстаткиПоОрганизацииРН.Остатки(, Организация = &Организация) КАК ЭП_ОстаткиПоОрганизацииРНОстатки
		|		ПО ВТ.Номенклатура = ЭП_ОстаткиПоОрганизацииРНОстатки.Номенклатура
		|			И ВТ.ИнвентарныйНомер = ЭП_ОстаткиПоОрганизацииРНОстатки.ИнвентарныйНомер
		|ГДЕ
		|	ЭП_ОстаткиПоОрганизацииРНОстатки.КоличествоОстаток > 0";
		
		Запрос.УстановитьПараметр("Склад", Параметры.Склад);
		Запрос.УстановитьПараметр("ИнвентарныйНомер", МассивИнвентарныйНомер);
		Запрос.УстановитьПараметр("Организация", Параметры.Организация);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл 
			
			ВидНоменклатуры = Выборка.ВидНоменклатуры;
			Номенклатура = Выборка.Номенклатура;
			ИнвентарныйНомер = Выборка.ИнвентарныйНомер;
			НовСтр = НоменклатураДляВыдачи.Добавить();
			НовСтр.НоменклатураВыдача = Номенклатура;
			НовСтр.ИнвентарныйНомерВыдача = ИнвентарныйНомер;
			НовСтр.ВидНоменклатуры = ВидНоменклатуры;
			НовСтр.КачествоНоменклатуры = РегистрыСведений.ЭП_КачествоНоменклатуры.ПолучитьПоследнее(ТекущаяДатаСеанса(), 
							Новый Структура("Номенклатура, ИнвентарныйНомер",Номенклатура,ИнвентарныйНомер)).КачествоНоменклатуры;
			ЗаполнитьЗначенияСвойств(НовСтр,Выборка);
			
		КонецЦикла; 
		
	КонецЕсли; 
	
КонецПроцедуры
                                  
&НаКлиенте
Процедура НоменклатураДляВыдачиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;
	
	СтрокаВыбора = Элементы.НоменклатураДляВыдачи.ТекущиеДанные; 
	НайденныеСтрокиИнвентарныйНомер = НоменклатураДляПередачи.НайтиСтроки(Новый Структура("ИнвентарныйНомер", СтрокаВыбора.ИнвентарныйНомерВыдача));
	НайденныеСтрокиНоменклатура = НоменклатураДляПередачи.НайтиСтроки(Новый Структура("Номенклатура", СтрокаВыбора.НоменклатураВыдача));
	НайденныеСтрокиВидНоменклатуры = НоменклатураДляПередачи.НайтиСтроки(Новый Структура("ВидНоменклатуры", СтрокаВыбора.ВидНоменклатуры));
	НайденныеСтрокиКачествоНоменклатуры = НоменклатураДляПередачи.НайтиСтроки(Новый Структура("КачествоНоменклатуры", СтрокаВыбора.КачествоНоменклатуры));
	Если НайденныеСтрокиИнвентарныйНомер.Количество() = 0 Тогда
		
		Строка = НоменклатураДляПередачи.Добавить();
		Строка.Номенклатура = СтрокаВыбора.НоменклатураВыдача;
		Строка.ИнвентарныйНомер = СтрокаВыбора.ИнвентарныйНомерВыдача;
		Строка.ВидНоменклатуры = СтрокаВыбора.ВидНоменклатуры;
		Строка.КачествоНоменклатуры = СтрокаВыбора.КачествоНоменклатуры;
		
		Для Каждого Строка Из НоменклатураДляПередачи Цикл
			Если Строка.ИнвентарныйНомер = СтрокаВыбора.ИнвентарныйНомерВыдача Тогда 
				НоменклатураДляВыдачи.Удалить(СтрокаВыбора);		
			КонецЕсли;
		КонецЦикла; 
		
	ИначеЕсли НайденныеСтрокиНоменклатура.Количество() = 0 Тогда
		
		Строка = НоменклатураДляПередачи.Добавить();
		Строка.Номенклатура = СтрокаВыбора.НоменклатураВыдача;
		Строка.ИнвентарныйНомер = СтрокаВыбора.ИнвентарныйНомерВыдача;
		Строка.ВидНоменклатуры = СтрокаВыбора.ВидНоменклатуры;
		Строка.КачествоНоменклатуры = СтрокаВыбора.КачествоНоменклатуры;
		
		Для Каждого Строка Из НоменклатураДляПередачи Цикл
			Если Строка.ИнвентарныйНомер = СтрокаВыбора.ИнвентарныйНомерВыдача И Строка.ВидНоменклатуры = СтрокаВыбора.ВидНоменклатуры и
						Строка.КачествоНоменклатуры = СтрокаВыбора.КачествоНоменклатуры Тогда 
				НоменклатураДляВыдачи.Удалить(СтрокаВыбора);		
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураВПередачуВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	СтрокаВыбора = Элементы.НоменклатураВПередачу.ТекущиеДанные; 
	НайденныеСтрокиИнвентарныйНомер = НоменклатураДляВыдачи.НайтиСтроки(Новый Структура("ИнвентарныйНомерВыдача", СтрокаВыбора.ИнвентарныйНомер));
	НайденныеСтрокиНоменклатура = НоменклатураДляВыдачи.НайтиСтроки(Новый Структура("НоменклатураВыдача", СтрокаВыбора.Номенклатура));
	НайденныеСтрокиВидНоменклатуры = НоменклатураДляВыдачи.НайтиСтроки(Новый Структура("ВидНоменклатуры", СтрокаВыбора.ВидНоменклатуры)); 
	НайденныеСтрокиКачествоНоменклатуры = НоменклатураДляПередачи.НайтиСтроки(Новый Структура("КачествоНоменклатуры", СтрокаВыбора.КачествоНоменклатуры));
	Если НайденныеСтрокиИнвентарныйНомер.Количество() = 0 Тогда
		
		Строка = НоменклатураДляВыдачи.Добавить();
		Строка.НоменклатураВыдача = СтрокаВыбора.Номенклатура;
		Строка.ИнвентарныйНомерВыдача = СтрокаВыбора.ИнвентарныйНомер;
		Строка.ВидНоменклатуры = СтрокаВыбора.ВидНоменклатуры;
		Строка.КачествоНоменклатуры = СтрокаВыбора.КачествоНоменклатуры;
		
		Для Каждого Строка Из НоменклатураДляПередачи Цикл
			Если Строка.ИнвентарныйНомер = СтрокаВыбора.ИнвентарныйНомер Тогда 
				НоменклатураДляПередачи.Удалить(СтрокаВыбора);		
			КонецЕсли;
		КонецЦикла; 
		
	ИначеЕсли НайденныеСтрокиНоменклатура.Количество() = 0 Тогда
		
		Строка = НоменклатураДляВыдачи.Добавить();
		Строка.НоменклатураВыдача = СтрокаВыбора.НоменклатураВыдача;
		Строка.ИнвентарныйНомерВыдача = СтрокаВыбора.ИнвентарныйНомерВыдача;
		Строка.ВидНоменклатуры = СтрокаВыбора.ВидНоменклатуры;	
		Строка.КачествоНоменклатуры = СтрокаВыбора.КачествоНоменклатуры;
		Для Каждого Строка Из НоменклатураДляПередачи Цикл
			Если Строка.ИнвентарныйНомер = СтрокаВыбора.ИнвентарныйНомер Тогда 
				НоменклатураДляПередачи.Удалить(СтрокаВыбора);		
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	Адрес = ПоместитьТоварыИзПодбораВоВременноеХранилище();
	ОповеститьОВыборе(Адрес);
КонецПроцедуры 

&НаСервере
Функция ПоместитьТоварыИзПодбораВоВременноеХранилище()
	Возврат ПоместитьВоВременноеХранилище(НоменклатураДляПередачи.Выгрузить());
КонецФункции

#Область АвтоматическоеЗаполнениеПоляКачествоНоменклатуры
 
 &НаСервере
Функция ПолучитьКачествоНоменклатуры(Номенклатура, ИнвентарныйНомер)   
	 Отбор = Новый Структура("Номенклатура, ИнвентарныйНомер", Номенклатура, ИнвентарныйНомер);
	 Возврат РегистрыСведений.ЭП_КачествоНоменклатуры.ПолучитьПоследнее(ТекущаяДатаСеанса(), Отбор).КачествоНоменклатуры;
КонецФункции

&НаКлиенте
Процедура УстановитьКачествоНоменклатурыДляВыдачи()
	СтрокаНоменклатуры = Элементы.НоменклатураДляВыдачи.ТекущиеДанные; 
	Если ЗначениеЗаполнено(СтрокаНоменклатуры.НоменклатураВыдача) И ЗначениеЗаполнено(СтрокаНоменклатуры.ИнвентарныйНомерВыдача) Тогда
		КачествоНоменклатуры = ПолучитьКачествоНоменклатуры(СтрокаНоменклатуры.НоменклатураВыдача, СтрокаНоменклатуры.ИнвентарныйНомерВыдача);
		Если КачествоНоменклатуры.Пустая() Тогда
			СтрокаНоменклатуры.КачествоНоменклатуры = ПредопределенноеЗначение("Справочник.ЭП_КачествоНоменклатуры.Новый");
		Иначе
			СтрокаНоменклатуры.КачествоНоменклатуры = КачествоНоменклатуры; 
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьКачествоНоменклатурыДляПередачи()
	СтрокаНоменклатуры = Элементы.НоменклатураВПередачу.ТекущиеДанные; 
	Если ЗначениеЗаполнено(СтрокаНоменклатуры.Номенклатура) И ЗначениеЗаполнено(СтрокаНоменклатуры.ИнвентарныйНомер) Тогда
		КачествоНоменклатуры = ПолучитьКачествоНоменклатуры(СтрокаНоменклатуры.Номенклатура, СтрокаНоменклатуры.ИнвентарныйНомер);
		Если КачествоНоменклатуры.Пустая() Тогда
			СтрокаНоменклатуры.КачествоНоменклатуры = ПредопределенноеЗначение("Справочник.ЭП_КачествоНоменклатуры.Новый");
		Иначе
			СтрокаНоменклатуры.КачествоНоменклатуры = КачествоНоменклатуры; 
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураДляВыдачиНоменклатураВыдачаПриИзменении(Элемент)
	УстановитьКачествоНоменклатурыДляВыдачи();
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураДляВыдачиИнвентарныйНомерВыдачаПриИзменении(Элемент)
	УстановитьКачествоНоменклатурыДляВыдачи();
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураВПерелдачуНоменклатураПриИзменении(Элемент)
	УстановитьКачествоНоменклатурыДляПередачи();
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураВПерелдачуИнвентарныйНомерПриИзменении(Элемент)
	УстановитьКачествоНоменклатурыДляПередачи();
КонецПроцедуры

#КонецОбласти
